In [11]:
import pandas as pd

In [12]:
import numpy as np

In [10]:
import matplotlib.pyplot as plt

In [14]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [15]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.148236  1.738514 -0.846570  2.223020
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-03  1.340884  1.030126  1.171791  0.622102
2013-01-04 -1.294425 -0.545184  1.470301  0.609967
2013-01-05  1.071540  0.280483  0.509298 -2.091711
2013-01-06  1.024066 -1.228283  0.371140 -0.081082

In [22]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index = list(range(4)), dtype = 'float32'),
                    'D' : np.array([3] * 4, dtype = 'int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'
                     })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [31]:
# df2.<TAB>

#  Viewing Data (데이터 확인하기)

In [32]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.294425 -0.545184  1.470301  0.609967
2013-01-05  1.071540  0.280483  0.509298 -2.091711
2013-01-06  1.024066 -1.228283  0.371140 -0.081082

In [33]:
df.tail()

                   A         B         C         D
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-03  1.340884  1.030126  1.171791  0.622102
2013-01-04 -1.294425 -0.545184  1.470301  0.609967
2013-01-05  1.071540  0.280483  0.509298 -2.091711
2013-01-06  1.024066 -1.228283  0.371140 -0.081082

In [34]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [36]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [37]:
df.values

array([[ 1.148236  ,  1.73851431, -0.84657002,  2.22302017],
       [ 0.45208816, -1.36444267,  1.01905381, -0.99855461],
       [ 1.34088391,  1.03012646,  1.17179112,  0.62210176],
       [-1.2944255 , -0.54518385,  1.47030094,  0.60996666],
       [ 1.07154009,  0.28048307,  0.50929761, -2.09171058],
       [ 1.02406572, -1.22828266,  0.3711395 , -0.08108166]])

In [38]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.623731 -0.014798  0.615835  0.047290
std    0.985799  1.251284  0.826031  1.487710
min   -1.294425 -1.364443 -0.846570 -2.091711
25%    0.595083 -1.057508  0.405679 -0.769186
50%    1.047803 -0.132350  0.764176  0.264442
75%    1.129062  0.842716  1.133607  0.619068
max    1.340884  1.738514  1.470301  2.223020

In [40]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.148236    0.452088    1.340884   -1.294425    1.071540    1.024066
B    1.738514   -1.364443    1.030126   -0.545184    0.280483   -1.228283
C   -0.846570    1.019054    1.171791    1.470301    0.509298    0.371140
D    2.223020   -0.998555    0.622102    0.609967   -2.091711   -0.081082

In [41]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  2.223020 -0.846570  1.738514  1.148236
2013-01-02 -0.998555  1.019054 -1.364443  0.452088
2013-01-03  0.622102  1.171791  1.030126  1.340884
2013-01-04  0.609967  1.470301 -0.545184 -1.294425
2013-01-05 -2.091711  0.509298  0.280483  1.071540
2013-01-06 -0.081082  0.371140 -1.228283  1.024066

In [43]:
df.sort_index(axis = 1, ascending = True)

                   A         B         C         D
2013-01-01  1.148236  1.738514 -0.846570  2.223020
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-03  1.340884  1.030126  1.171791  0.622102
2013-01-04 -1.294425 -0.545184  1.470301  0.609967
2013-01-05  1.071540  0.280483  0.509298 -2.091711
2013-01-06  1.024066 -1.228283  0.371140 -0.081082

In [44]:
df.sort_values(by = 'B')

                   A         B         C         D
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-06  1.024066 -1.228283  0.371140 -0.081082
2013-01-04 -1.294425 -0.545184  1.470301  0.609967
2013-01-05  1.071540  0.280483  0.509298 -2.091711
2013-01-03  1.340884  1.030126  1.171791  0.622102
2013-01-01  1.148236  1.738514 -0.846570  2.223020

# Selection (선택)
주석 (Note) : 선택과 설정을 위한 Python / Numpy의 표준화된 표현들이 직관적이며, 코드 작성을 위한 양방향 작업에 유용하지만 우리는 Pandas에 최적화된 데이터 접근 방법인 .at, .iat, .loc 및 .iloc 을 추천합니다.

## getting(데이터 얻기)
df.A와 동일한 Series를 생성하는 단일 열을 선택합니다.

In [45]:
df['A']

2013-01-01    1.148236
2013-01-02    0.452088
2013-01-03    1.340884
2013-01-04   -1.294425
2013-01-05    1.071540
2013-01-06    1.024066
Freq: D, Name: A, dtype: float64

In [46]:
df[0:3]

                   A         B         C         D
2013-01-01  1.148236  1.738514 -0.846570  2.223020
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-03  1.340884  1.030126  1.171791  0.622102

In [48]:
df['20130102' : '20130104']

                   A         B         C         D
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-03  1.340884  1.030126  1.171791  0.622102
2013-01-04 -1.294425 -0.545184  1.470301  0.609967

In [51]:
df.loc[dates[0]]

A    1.148236
B    1.738514
C   -0.846570
D    2.223020
Name: 2013-01-01 00:00:00, dtype: float64

In [52]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.148236  1.738514
2013-01-02  0.452088 -1.364443
2013-01-03  1.340884  1.030126
2013-01-04 -1.294425 -0.545184
2013-01-05  1.071540  0.280483
2013-01-06  1.024066 -1.228283

In [53]:
df.loc['20130102' : '20130104', ['A','B']]

                   A         B
2013-01-02  0.452088 -1.364443
2013-01-03  1.340884  1.030126
2013-01-04 -1.294425 -0.545184

In [54]:
df

                   A         B         C         D
2013-01-01  1.148236  1.738514 -0.846570  2.223020
2013-01-02  0.452088 -1.364443  1.019054 -0.998555
2013-01-03  1.340884  1.030126  1.171791  0.622102
2013-01-04 -1.294425 -0.545184  1.470301  0.609967
2013-01-05  1.071540  0.280483  0.509298 -2.091711
2013-01-06  1.024066 -1.228283  0.371140 -0.081082

In [55]:
df.loc['20130102', ['A', 'B']]

A    0.452088
B   -1.364443
Name: 2013-01-02 00:00:00, dtype: float64

In [56]:
df.loc[dates[0], 'A']

1.1482360038850155

In [57]:
df.at[dates[0], 'A']

1.1482360038850155

## Selection by Position (d위치로 선택하기)

In [59]:
df.iloc[3]

A   -1.294425
B   -0.545184
C    1.470301
D    0.609967
Name: 2013-01-04 00:00:00, dtype: float64